Tekla Open API Reference for Tekla Structures 2025
ReferenceModel.RemoveRevision Method
 Removes the given revision from the reference model.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool RemoveRevision(
	ReferenceModel.Revision revision
)
Public Function RemoveRevision (
	revision As ReferenceModel.Revision
) As Boolean
Parameters
revision
Type: Tekla.Structures.Model.ReferenceModel.Revision
The reference model revision to be removed.
Return Value
Type: Boolean
 True if removed successfully, otherwise false.
See Also
Reference
ReferenceModel Class
Tekla.Structures.Model Namespace